# Задайте список из n чисел последовательности (1+1/n)**n и выведите на экран их сумму.
# *Пример:*
# - Для n = 6: {1: 2.0, 2: 2.25, 3: 2.37037037037037, 4: 2.44140625, 5: 2.4883199999999994, 6: 2.5216263717421135}

number = int(input('Введите число '))
lst = {}
sum = 0
for i in range(1, number + 1):
    result = {i: (1+1/i)**i}
    lst.update(result)
    sum = sum + (1+1/i)**i
print(lst)
print('Сумма значений =', sum)